soapRequest.xml

<?xml version="1.0" encoding="UTF-8"?><S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
    <SOAP-ENV:Header/>
    <S:Body xmlns:ns2="http://api.service.bgonzalez2.itmd4515.sat.iit.edu/">
        <ns2:createNewOwner>
            <arg0>Created From Curl Client</arg0>
        </ns2:createNewOwner>
    </S:Body>
</S:Envelope>
